Autodesk.Revit.DB.BuiltInFailures.LegendFailures.LegendComponentNotVisible
The component you have selected is not visible in the selected view.

Autodesk.Revit.DB.BuiltInFailures.LegendFailures.LegendComponentBadViewType
Legend Components may only be placed in Legends

Autodesk.Revit.DB.BuiltInFailures.LegendFailures
Failures about Legend.